recipes/homemade-chilli-oil.org
#+TITLE: Homemade Chilli Oil
#+DATE: 2020-10-22
#+SETUPFILE: recipe.setup

[[https://www.youtube.com/watch?v=DUDKIcYltZA][Original link]]

* Ingredients
- 2 tsp Sichuan peppercorns
- 4 tbsp red pepper powder/gochugaru*
- 2 tbsp white sesame seeds
- 1 star anise
- 1 bay leaf
- 1 tsp sesame oil
- 1 cup grapeseed oil
- 1 small piece of ginger

* Instructions
1. Crush the peppercorns in a pestle and mortar.  Then, add all of the dry ingredients into a mason jar
2. Add the sesame oil into the jar
3. Heat the grapeseed oil in a saucepan over medium high heat for about 5-8min
4. Place the ginger in the oil
5. When the ginger turns golden brown, remove it, and turn the heat off
6. Carefully pour the hot oil into the mason jar.
