recipes/homemade-chilli-oil.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Homemade Chilli Oil</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Homemade Chilli Oil</h1>
<p>
<a href="https://www.youtube.com/watch?v=DUDKIcYltZA">Original link</a>
</p>

<div id="outline-container-org57bad59" class="outline-2">
<h2 id="org57bad59">Ingredients</h2>
<div class="outline-text-2" id="text-org57bad59">
<ul class="org-ul">
<li>2 tsp Sichuan peppercorns</li>
<li>4 tbsp red pepper powder/gochugaru*</li>
<li>2 tbsp white sesame seeds</li>
<li>1 star anise</li>
<li>1 bay leaf</li>
<li>1 tsp sesame oil</li>
<li>1 cup grapeseed oil</li>
<li>1 small piece of ginger</li>
</ul>
</div>
</div>

<div id="outline-container-org4b6dd22" class="outline-2">
<h2 id="org4b6dd22">Method</h2>
<div class="outline-text-2" id="text-org4b6dd22">
<ol class="org-ol">
<li>Crush the peppercorns in a pestle and mortar.  Then, add all of the dry ingredients into a mason jar</li>
<li>Add the sesame oil into the jar</li>
<li>Heat the grapeseed oil in a saucepan over medium high heat for about 5-8min</li>
<li>Place the ginger in the oil</li>
<li>When the ginger turns golden brown, remove it, and turn the heat off</li>
<li>Carefully pour the hot oil into the mason jar.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
